%-----------------------------------------------------------
%Método do Nesterov accelerated gradient utilizado para 
%otimizar a trajetória do centro de massa do modelo 3D dual SLIP
%-----------------------------------------------------------
function [U,vt] = NAG(U0,X0,vt)
%-----------------------------------------------------------
%variáveis globais
%-----------------------------------------------------------
    global ganhoAlpha gamma
%-----------------------------------------------------------
%cálculando o valor com o ganho anterior
%-----------------------------------------------------------    
    y1 = U0(1,1) - gamma*vt(1,1);
    y2 = U0(2,1) - gamma*vt(2,1);
    y3 = U0(3,1) - gamma*vt(3,1);
    y4 = U0(4,1) - gamma*vt(4,1);
    y5 = U0(5,1);     
    Y0 = [y1;y2;y3;y4;y5];
%-----------------------------------------------------------
%cálculo do gradiente da função
%-----------------------------------------------------------       
    G = gradienteFuncao(X0,Y0);
    g1 = G(1,1);
    g2 = G(2,1);
    g3 = G(3,1);
    g4 = G(4,1);
%-----------------------------------------------------------
%cálculando o valor com o ganho atual
%-----------------------------------------------------------      
    vt(1,1) = gamma*vt(1,1) + ganhoAlpha*g1;
    vt(2,1) = gamma*vt(2,1) + ganhoAlpha*g2;
    vt(3,1) = gamma*vt(3,1) + ganhoAlpha*g3;
    vt(4,1) = gamma*vt(4,1) + ganhoAlpha*g4;

    u1 = U0(1,1) - vt(1,1);
    u2 = U0(2,1) - vt(2,1);
    u3 = U0(3,1) - vt(3,1);
    u4 = U0(4,1) - vt(4,1);
    u5 = U0(5,1);
%-----------------------------------------------------------
%Valor atualizado
%-----------------------------------------------------------         
    U = [u1;u2;u3;u4;u5];
end