%-----------------------------------------------------------
%Método do gradiente descendente estocástico utilizado para 
%otimizar a trajetória do centro de massa do modelo 3D dual SLIP
%-----------------------------------------------------------
function U = SGD(U0,X0)
%-----------------------------------------------------------
%variáveis globais
%-----------------------------------------------------------
    global ganhoAlpha 
%-----------------------------------------------------------
%cálculo do gradiente da função
%-----------------------------------------------------------    
    G = gradienteFuncao(X0,U0);
    g1 = G(1,1);
    g2 = G(2,1);
    g3 = G(3,1);
    g4 = G(4,1);
%-----------------------------------------------------------
%atualizando o valor do vetor de controle - U SGD
%-----------------------------------------------------------        
    u1 = U0(1,1) - ganhoAlpha*g1;
    u2 = U0(2,1) - ganhoAlpha*g2;
    u3 = U0(3,1) - ganhoAlpha*g3;
    u4 = U0(4,1) - ganhoAlpha*g4;
    u5 = U0(5,1);
%-----------------------------------------------------------
%Valor atualizado
%-----------------------------------------------------------       
    U = [u1;u2;u3;u4;u5];
end